In [1]:
import pandas as pd

In [2]:
data = {'nama_lengkap' : ['Thomas Brian', 'Dewi Sartika', 'Camilla Ava'],
        'tempat_lahir' : ['Tulungagung, Jawa Timur', 'Salappa, Mentawai', 'Sidoarjo, Jawa Timur']}

df = pd.DataFrame(data)
df

   nama_lengkap             tempat_lahir
0  Thomas Brian  Tulungagung, Jawa Timur
1  Dewi Sartika        Salappa, Mentawai
2   Camilla Ava     Sidoarjo, Jawa Timur

In [6]:
df[['nama_depan', 'nama_belakang']] = df['nama_lengkap'].str.split(' ', expand=True)
df

   nama_lengkap             tempat_lahir nama_depan nama_belakang
0  Thomas Brian  Tulungagung, Jawa Timur     Thomas         Brian
1  Dewi Sartika        Salappa, Mentawai       Dewi       Sartika
2   Camilla Ava     Sidoarjo, Jawa Timur    Camilla           Ava

In [7]:
df[['kota', 'Provinsi']] = df['tempat_lahir'].str.split(',', expand=True)
df

,nama_lengkap,tempat_lahir,nama_depan,nama_belakang,kota,Provinsi
0,Thomas Brian,"Tulungagung, Jawa Timur",Thomas,Brian,Tulungagung,Jawa Timur
1,Dewi Sartika,"Salappa, Mentawai",Dewi,Sartika,Salappa,Mentawai
2,Camilla Ava,"Sidoarjo, Jawa Timur",Camilla,Ava,Sidoarjo,Jawa Timur